// 사회 목차 
$(function(){
	// 레이아웃 만들기
	var uiInner =
	'			<div id="index">'
	+'				<div class="index-inner">'
	+'					<div class="index-hd">'
	+'						<button type="button" class="icon icon-mn-close index-toggle">목차닫기</button>'
	+'						<strong class="font-bmjua">목차</strong>'
	+'					</div>'
	+'					<div class="index-navi">'
	+'						<div class="index-lesson">'
	+'							<ol class="index-lesson-list"></ol>'
	+'						</div>'
	+'						<div class="index-corner"></div>'
	+'					</div>'
	+'				</div>'
	+'			</div>'
	$('#wrap').append(uiInner);

	// 목차 만들기
	var $listChapter = $('.index-lesson-list'),
		chapterNum=0,
		chapter2Num,
		chapter3Num,
		cornerNum,
		cornerBtn;
	$(dataChapter).each(function(i){
		// no
		var no = '';
		cornerBtn = '';
		if(dataChapter[i][2]=='●'){
			no = 'class="dot"';
		}
		if(dataChapter[i][0]){
			// 대단원
			chapterNum++;
			chapter2Num=1,
			chapter3Num=0;
			cornerNum = `data-corner="`+chapterNum+`_`+chapter2Num+`"`;
			cornerBtn = 'role="button"';
			$listChapter.append(`
				<li>
					<div>`+dataChapter[i][0]+`</div>
					<ol>
						<li>
							<div role="button" `+cornerNum+` `+no+` data-num="`+dataChapter[i][2]+`">`+dataChapter[i][1]+`</div>
							<ol class="part-list">
								<li `+no+`>
									<div `+cornerBtn+` `+cornerNum+` data-num="`+dataChapter[i][2]+`">`+dataChapter[i][3]+`</div>
								</li>
							</ol>
						</li>
					</ol>
				</li>
			`);
		} else if(dataChapter[i][1]){
			// 중단원
			chapter2Num++;
			chapter3Num=0;
			cornerNum = `data-corner="`+chapterNum+`_`+chapter2Num+`"`;
			cornerBtn = 'role="button"';
			$listChapter.find('>li:last-child>ol').append(`
				<li>
					<div role="button">`+dataChapter[i][1]+`</div>
					<ol class="part-list">
						<li `+no+`>
							<div `+cornerBtn+` `+cornerNum+` data-num="`+dataChapter[i][2]+`">`+dataChapter[i][3]+`</div>
						</li>
					</ol>
				</li>
			`);
		} else {
			// 차시 - 마무리 차시 예외 처리
			if(dataChapter[i][3]=='단원 마무리'){
				cornerNum = `data-corner="`+chapterNum+`_`+chapter2Num+`_fin"`;
				cornerBtn = 'role="button"';
			} else {
				chapter3Num++;
				cornerNum = `data-corner="`+chapterNum+`_`+chapter2Num+`_`+chapter3Num+`"`;
				cornerBtn = 'role="button"';
			}

			$('.part-list:last').append(`
				<li `+no+`>
					<div `+cornerBtn+` `+cornerNum+` data-num="`+dataChapter[i][2]+`">`+dataChapter[i][3]+`</div>
				</li>
			`);
		}
	});
	$('.index-lesson').mCustomScrollbar({
		mouseWheel:{ scrollAmount: 200 },
	});

	// 차시 만들기
	var $listCorner = $('.index-corner'),
		listCorner = `
		<ol class="index-corner-list" id="corner_`+dataCorner[0][0].substr(7)+`" style="display:none">
			<li class="part">
				<strong>`+dataCorner[0][4]+`</strong>
				<ol>
		`,
		cornerId = '';
	$(dataCorner).each(function(i){
		// 차시 변경 열기
		if(dataCorner[i-1]!=undefined && (dataCorner[i][1]!=dataCorner[i-1][1])){
			if(dataCorner[i][1]=='단원마무리'){
				cornerId = dataCorner[i][0].substr(7)+'_fin';
			} else {
				cornerId = dataCorner[i][0].substr(7);
			}
			listCorner = listCorner + `<ol class="index-corner-list" id="corner_`+cornerId+`" style="display:none">`;
		}
		// 단계 변경 열기
		if(dataCorner[i-1]!=undefined && (dataCorner[i][4]!=dataCorner[i-1][4])){
			listCorner = listCorner + `
					<li class="part">
						<strong>`+dataCorner[i][4]+`</strong>
						<ol>
			`;
		}
		// 코너(기본)
		listCorner = listCorner+`<li><div data-page="`+dataCorner[i][2]+`" data-folder="`+dataCorner[i][0].substr(7,1)+dataCorner[i][0].substr(9,1)+`" data-page-num="`+dataCorner[i][6]+`" role="button">`+dataCorner[i][5]+`</div></li>`;
		// 단계 변경 닫기
		if(dataCorner[i+1]!=undefined && (dataCorner[i][4]!=dataCorner[i+1][4])){
			listCorner = listCorner + `</ol></li>`;
		}
		// 차시 변경 닫기
		if(dataCorner[i+1]!=undefined && (dataCorner[i][1]!=dataCorner[i+1][1])){
			// 차시 변경 시
			listCorner = listCorner + `</ol>`;
		}
	});
	$listCorner.html(listCorner+`</ol></li></ol>`);

	// 목차 열기
	$(document).on('click', '.index-toggle', function(){
		var $index = $('#index');
		if($index.hasClass('active')){
			$index.removeClass('active');
			setTimeout(function(){
				$index.hide();
			},600);
		}else{
			$index.show(0, function(){
				$index.addClass('active');
			});
			$('.index-navi>div').each(function(){
				$(this).mCustomScrollbar("scrollTo", $(this).find('.active')[0].offsetTop-100,{
					scrollInertia: 0
				});
			});
		}
	});

	// 목차 목록 클릭 
	$(document).on('click','.index-lesson-list [role=button]',function(){
		var $corner = $('.index-corner-list');
		$('.index-lesson-list .active').removeClass('active');
		$(this).parent().addClass('active');

		$('#corner_'+$(this).attr('data-corner')).show().siblings().hide();
		$('.index-corner').mCustomScrollbar({
			mouseWheel:{ scrollAmount: 200 },
		});
	});

	// 차시 목록 클릭
	$(document).on('click', '[data-page]', function(){
		/*
		var page = this.dataset.page.split('-');
		var lesson = uiData[page[0]],
			part = lesson.part[page[1]],
			corner = part.corner[page[2]];
		var url = `/viewer/contents/index.html?contentInformationURL=../../resource/contents/${lesson.folder}&pageName=${corner.url}`;
		console.log(url);
		jj.link.html(url, '_top');
		*/
		// 임시로 주소 이동으로
		//window.location.href = '../../lesson0'+$(this).data('folder')+'/ops/'+$(this).data('page');
		
		jj.link.html('/viewer/contents/index.html?contentInformationURL=../../resource/contents/lesson0'+$(this).data('folder')+'/&pageName='+$(this).data('page'),'_top');
	});
	//
	// 주제 마무리 클릭
	$(document).on('click', '[data-page-fin0]', function(){
		$('#corner_'+$(this).parent().prev().children().data('corner')).find('[data-page]').filter(function(){
			return $(this).text()=='재미 콕콕 주제 마무리';
		}).click();
	});
	// 이북
	$(document).on('click', 'button.page-label', function(){
		var p = $('#page-num').text().split('쪽')[0];
		if($('#page-num').text().split('~')[1]){
			p = $('#page-num').text().split('~')[0];
		}
		p = parseFloat(p);
		jj.link.html("/viewer/ebook/index.html?contentInformationURL=../../resource/ebook/&page=" +p, "_top");
	});
	// 닫기
	$(document).on('click', 'button.icon-hd-close', function(){
		var p = $('#page-num').text().split('쪽')[0];
		if($('#page-num').text().split('~')[1]){
			p = $('#page-num').text().split('~')[0];
		}
		p = parseFloat(p);
		jj.link.html("/viewer/ebook/index.html?contentInformationURL=../../resource/ebook/&page=" +p, "_top");
	});

	// 시작
	var url = window.location.href;
	if(url.indexOf('ops')<0){
		return false;
	}
	var $currentPage = $('[data-page="'+url.split('lesson')[1].split('ops/')[1]+'"][data-folder="'+url.split('lesson')[1].split('/')[0].slice(-2)+'"]');

	setTimeout(function(){
		// 선택된 메뉴 표시
		$currentPage.parent().addClass('active').closest('.index-corner-list').show();


		$('[data-corner="'+$currentPage.closest('.index-corner-list').attr('id').split('corner_')[1]+'"]:not(.dot)').addClass('active').click();
		// 상단 표시
		$currentPage2 = $('[data-corner="'+$currentPage.closest('.index-corner-list').attr('id').split('corner_')[1]+'"]:last');

		var numCircle = `<span class="num-circle">`+$currentPage2.data('num')+`</span>`;
		if($currentPage2.data('num')=='●'){
			numCircle='';
		}
		$('.page-bread').html(`
			<span>`+Number($currentPage2.closest('ol').prev('div').parent().index()+1)+`. `+$currentPage2.closest('ol').prev('div').text()+`</span><span class="hd-part">`+numCircle+` `+$currentPage2.text()+`</span>
		`);

		$('#page-num').text($currentPage.data('page-num'));
		// 하단 표시
		var currentCorner = '';
		$currentPage.closest('.index-corner-list').children().each(function(i){
			var $t = $(this),
				active = '';
			if($t.children('strong').text()===$currentPage.closest('ol').prev().text()){
				active = 'active';
			}
			currentCorner = currentCorner + `<button type="button" class="ft-navi-link `+active+`" data-page="`+$t.find('[data-page]:first').data('page')+`" data-folder="`+$t.find('[data-page]:first').data('folder')+`"><span>`+$t.children('strong').text()+`</span></button>`
		});
		$('.ft-navi').html(currentCorner);
		var currentCornerNum = 0;
		$currentPage.closest('.part').prevAll().each(function(){
			currentCornerNum = currentCornerNum + $(this).find('ol>li').length;
		});
		$('#current').text(Number($currentPage.parent().index()+1)+currentCornerNum);
		$('#total').text($currentPage.closest('.index-corner-list').find('ol>li').length);
		// 차시 이전-다음 버튼
		$(document).on('click','button.icon-paging-prev',function(){
			var $o = $currentPage.parent().prev().children();
			if(!$o.length){
				$o = $currentPage.closest('.part').prev().find('li:last-child>div');
			}
			$o.click();
		});
		$(document).on('click','button.icon-paging-next',function(){
			var $o = $currentPage.parent().next().children();
			if(!$o.length){
				$o = $currentPage.closest('.part').next().find('li:first-child>div');
			}
			$o.click();
		});
	},100);
})

// 목차 : 대단원,중단원,no,차시명,수업하기,교과서
var dataChapter = [
	["유적과 유물로 <br>살펴본 옛사람들의 <br>생활","선사 시대와 고조선 사람들의 생활 모습","●","단원 도입 / 주제 도입","수업하기","10~15"],
	// ["","","●","단원 도입 / 주제 도입","수업하기","10~15"],
	["","","1","구석기 시대 사람들의 생활 모습을 알아볼까요","수업하기","16~17"],
	["","","2","신석기 시대 사람들의 생활 모습을 알아볼까요","수업하기","18~19"],
	["","","3","청동기 시대 사람들의 생활 모습을 알아볼까요","수업하기","20~23"],
	["","","4","고조선의 등장과 사회 모습을 알아볼까요","수업하기","24~27"],
	["","고대 사람들의 생활 모습","●","주제 도입","수업하기","28~29"],
	["","","1","고구려의 성장과 생활 모습을 알아볼까요","수업하기","30~33"],
	["","","2","백제의 성장과 생활 모습을 알아볼까요","수업하기","34~36"],
	["","","3","신라와 가야의 성장과 생활 모습을 알아볼까요","수업하기","37~40"],
	["","","4","신라의 삼국 통일을 알아볼까요","수업하기","41~43"],
	["","","5","발해의 성립과 생활 모습을 알아볼까요","수업하기","44~47"],
	["","고려 사람들의 생활 모습 ","●","주제 도입","수업하기","48~49"],
	["","","1","고려의 건국 과정을 알아볼까요","수업하기","50~51"],
	["","","2","고려의 사회 모습을 알아볼까요","수업하기","52~54"],
	["","","3","고려의 외침 극복 과정을 알아볼까요","수업하기","55~57"],
	["","","4","고려의 문화를 알아볼까요","수업하기","58~63"],
	["","","●","단원 마무리","수업하기","64~67"],
	["달라지는 시대, <br>변화하는 생활 모습","유교 문화를 바탕으로 한 조선","●","단원 도입 / 주제 도입","수업하기","68~73"],
	["","","1","유교를 바탕으로 건국된 조선은 어떤 나라였을까요","수업하기","74~77"],
	["","","2","조선 전기의 과학 기술과 문화는 어떻게 발전했을까요","수업하기","78~81"],
	["","","3","조선 사람들의 생활 모습을 알아볼까요","수업하기","82~85"],
	["","","4","조선은 임진왜란과 병자호란을 어떻게 이겨 냈을까요","수업하기","86~91"],
	["","조선 후기의 사회 변화와 근대 문물의 수용","●","주제 도입","수업하기","92~93"],
	["","","1","조선 후기 정치와 사회의 변화 모습을 알아볼까요","수업하기","94~97"],
	["","","2","조선 후기 새롭게 발달한 문화를 알아볼까요","수업하기","98~100"],
	["","","3","조선의 개항 과정을 알아볼까요","수업하기","101~103"],
	["","","4","개항 이후 나라를 개혁하려는 사람들의 생각을 알아볼까요","수업하기","104~107"],
	["","","5","근대 문물의 수용으로 달라진 생활 모습을 알아볼까요","수업하기","108~113"],
	["","","●","단원 마무리","수업하기","114~117"],
	["식민 통치와 저항, <br>전쟁이 바꾼 <br>사회와 생활","일제의 침략과 나라를 되찾기 위한 노력","●","단원 도입 / 주제 도입","수업하기","118~123"],
	["","","1","을사늑약 이후 나라를 지키기 위한 노력을 알아볼까요","수업하기","124~126"],
	["","","2","일제의 식민 통치 아래 사람들의 생활 모습을 알아볼까요","수업하기","127~131"],
	["","","3","3·1 운동과 대한민국 임시 정부에 대해 알아볼까요","수업하기","132~136"],
	["","","4","일제에 맞서 나라를 되찾기 위한 노력을 알아볼까요","수업하기","137~141"],
	["","8·15 광복과 6·25 전쟁","●","주제 도입","수업하기","142~143"],
	["","","1","8·15 광복으로 달라진 사람들의 생활 모습을 알아볼까요","수업하기","144~146"],
	["","","2","대한민국 정부 수립 과정을 알아볼까요","수업하기","147~149"],
	["","","3","6·25 전쟁으로 달라진 사람들의 생활 모습에 대해 알아볼까요","수업하기","150~153"],
	["","","4","6·25 전쟁의 피해와 영향을 알아볼까요","수업하기","154~157"],
	["","","●","단원 마무리","수업하기","158~161"]
]

// 차시 : 교과서,차시명,파일,정렬,단계,코너명,사회_교과서 페이지
var dataCorner = [
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_01.html",1,"도입","이번 시간에는","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_02.html",2,"도입","학습 목표","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_03.html",3,"도입","무엇을 배울까요?","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_04.html",4,"도입","숨은 장면 열어 보기","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_05.html",5,"도입","단원 열기 1","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_06.html",6,"도입","단원 열기 2","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_07.html",7,"도입","단원 열기 3","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_08.html",8,"도입","단원 열기 4","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_09.html",9,"도입","단원 열기 5","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page010_10.html",10,"도입","단원 열기 6","10~13쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page014_01.html",11,"도입","이번 시간에는","14쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page014_02.html",12,"도입","이 주제를 배우면?","14쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page014_03.html",13,"전개","생각이 활짝","14~15쪽"],
	["사회 5-2_1_1","단원 도입 / 주제 도입","page014_04.html",14,"정리","다음 시간에는","14~15쪽"],
	["사회 5-2_1_1_1","본차시1","page016_01.html",1,"도입","이번 시간에는","16쪽"],
	["사회 5-2_1_1_1","본차시1","page016_02.html",2,"도입","학습 목표","16쪽"],
	["사회 5-2_1_1_1","본차시1","page016_03.html",3,"도입","생각 열기","16쪽"],
	["사회 5-2_1_1_1","본차시1","page016_04.html",4,"전개","구석기 시대 사람들의 생활 모습 파악하기","16쪽"],
	["사회 5-2_1_1_1","본차시1","page017_01.html",5,"전개","활동해요","17쪽"],
	["사회 5-2_1_1_1","본차시1","page017_02.html",6,"정리","정리해요","17쪽"],
	["사회 5-2_1_1_1","본차시1","page017_03.html",7,"정리","확인해요","17쪽"],
	["사회 5-2_1_1_1","본차시1","page017_04.html",8,"정리","다음 시간에는","17쪽"],
	["사회 5-2_1_1_2","본차시2","page018_01.html",1,"도입","이번 시간에는","18쪽"],
	["사회 5-2_1_1_2","본차시2","page018_02.html",2,"도입","학습 목표","18쪽"],
	["사회 5-2_1_1_2","본차시2","page018_03.html",3,"도입","생각 열기","18쪽"],
	["사회 5-2_1_1_2","본차시2","page018_04.html",4,"전개","신석기 시대 사람들의 생활 모습 파악하기","18쪽"],
	["사회 5-2_1_1_2","본차시2","page018_05.html",5,"전개","활동해요","18~19쪽"],
	["사회 5-2_1_1_2","본차시2","page019_01.html",6,"정리","정리해요","19쪽"],
	["사회 5-2_1_1_2","본차시2","page019_02.html",7,"정리","확인해요","19쪽"],
	["사회 5-2_1_1_2","본차시2","page019_03.html",8,"정리","다음 시간에는","19쪽"],
	["사회 5-2_1_1_3","본차시3","page020_01.html",1,"도입","이번 시간에는","20쪽"],
	["사회 5-2_1_1_3","본차시3","page020_02.html",2,"도입","학습 목표","20쪽"],
	["사회 5-2_1_1_3","본차시3","page020_03.html",3,"도입","생각 열기","20쪽"],
	["사회 5-2_1_1_3","본차시3","page020_04.html",4,"전개","청동기 시대 사람들의 생활 모습 파악하기","20~21쪽"],
	["사회 5-2_1_1_3","본차시3","page021_01.html",5,"전개","활동해요","21쪽"],
	["사회 5-2_1_1_3","본차시3","page022_01.html",6,"전개","활동해요","22쪽"],
	["사회 5-2_1_1_3","본차시3","page023_01.html",7,"정리","정리해요","23쪽"],
	["사회 5-2_1_1_3","본차시3","page023_02.html",8,"정리","확인해요","23쪽"],
	["사회 5-2_1_1_3","본차시3","page023_03.html",9,"정리","다음 시간에는","23쪽"],
	["사회 5-2_1_1_4","본차시4","page024_01.html",1,"도입","이번 시간에는","24쪽"],
	["사회 5-2_1_1_4","본차시4","page024_02.html",2,"도입","학습 목표","24쪽"],
	["사회 5-2_1_1_4","본차시4","page024_03.html",3,"도입","생각 열기","24쪽"],
	["사회 5-2_1_1_4","본차시4","page024_04.html",4,"전개","고조선의 건국 이야기 살펴보기","24쪽"],
	["사회 5-2_1_1_4","본차시4","page025_01.html",5,"전개","고조선의 유적과 유물을 통해 고조선의 문화 범위 짐작하기","25쪽"],
	["사회 5-2_1_1_4","본차시4","page025_02.html",6,"전개","활동해요","25쪽"],
	["사회 5-2_1_1_4","본차시4","page026_01.html",7,"전개","궁금해요","26쪽"],
	["사회 5-2_1_1_4","본차시4","page026_02.html",8,"정리","정리해요","26쪽"],
	["사회 5-2_1_1_4","본차시4","page026_03.html",9,"정리","확인해요","26쪽"],
	["사회 5-2_1_1_4","본차시4","page027_01.html",10,"정리","재미 콕콕 주제 마무리","27쪽"],
	["사회 5-2_1_1_4","본차시4","page027_02.html",11,"정리","스스로 평가해요","27쪽"],
	["사회 5-2_1_1_4","본차시4","page027_03.html",12,"정리","다음 시간에는","27쪽"],

	["사회 5-2_1_2","주제 도입","page028_01.html",1,"도입","이번 시간에는","28쪽"],
	["사회 5-2_1_2","주제 도입","page028_02.html",2,"도입","이 주제를 배우면?","28쪽"],
	["사회 5-2_1_2","주제 도입","page028_03.html",3,"전개","생각이 활짝","28~29쪽"],
	["사회 5-2_1_2","주제 도입","page028_04.html",4,"정리","다음 시간에는","28~29쪽"],
	["사회 5-2_1_2_1","본차시1","page030_01.html",1,"도입","이번 시간에는","30쪽"],
	["사회 5-2_1_2_1","본차시1","page030_02.html",2,"도입","학습 목표","30쪽"],
	["사회 5-2_1_2_1","본차시1","page030_03.html",3,"도입","생각 열기","30쪽"],
	["사회 5-2_1_2_1","본차시1","page030_04.html",4,"전개","삼국의 건국 이야기 알아보기","30쪽"],
	["사회 5-2_1_2_1","본차시1","page030_05.html",5,"전개","활동해요","30쪽"],
	["사회 5-2_1_2_1","본차시1","page031_01.html",6,"전개","고구려의 성장 알아보기","31쪽"],
	["사회 5-2_1_2_1","본차시1","page032_01.html",7,"전개","고구려 사람들의 생활 모습 알아보기","32쪽"],
	["사회 5-2_1_2_1","본차시1","page032_02.html",8,"전개","활동해요","32~33쪽"],
	["사회 5-2_1_2_1","본차시1","page033_01.html",9,"정리","정리해요","33쪽"],
	["사회 5-2_1_2_1","본차시1","page033_02.html",10,"정리","확인해요","33쪽"],
	["사회 5-2_1_2_1","본차시1","page033_03.html",11,"정리","다음 시간에는","33쪽"],
	["사회 5-2_1_2_2","본차시2","page034_01.html",1,"도입","이번 시간에는","34쪽"],
	["사회 5-2_1_2_2","본차시2","page034_02.html",2,"도입","학습 목표","34쪽"],
	["사회 5-2_1_2_2","본차시2","page034_03.html",3,"도입","생각 열기","34쪽"],
	["사회 5-2_1_2_2","본차시2","page034_04.html",4,"전개","백제의 성장 알아보기","34쪽"],
	["사회 5-2_1_2_2","본차시2","page035_01.html",5,"전개","백제 사람들의 생활 모습 알아보기","35쪽"],
	["사회 5-2_1_2_2","본차시2","page035_02.html",6,"전개","활동해요","35쪽"],
	["사회 5-2_1_2_2","본차시2","page036_01.html",7,"전개","백제의 문화 알아보기","36쪽"],
	["사회 5-2_1_2_2","본차시2","page036_02.html",8,"전개","활동해요","36쪽"],
	["사회 5-2_1_2_2","본차시2","page036_03.html",9,"정리","정리해요","36쪽"],
	["사회 5-2_1_2_2","본차시2","page036_04.html",10,"정리","확인해요","36쪽"],
	["사회 5-2_1_2_2","본차시2","page036_05.html",11,"정리","다음 시간에는","36쪽"],
	["사회 5-2_1_2_3","본차시3","page037_01.html",1,"도입","이번 시간에는","37쪽"],
	["사회 5-2_1_2_3","본차시3","page037_02.html",2,"도입","학습 목표","37쪽"],
	["사회 5-2_1_2_3","본차시3","page037_03.html",3,"도입","생각 열기","37쪽"],
	["사회 5-2_1_2_3","본차시3","page037_04.html",4,"전개","신라의 성장 알아보기","37쪽"],
	["사회 5-2_1_2_3","본차시3","page037_05.html",5,"전개","활동해요","37쪽"],
	["사회 5-2_1_2_3","본차시3","page038_01.html",6,"전개","신라 사람들의 생활 모습 알아보기","38쪽"],
	["사회 5-2_1_2_3","본차시3","page038_02.html",7,"전개","궁금해요","38쪽"],
	["사회 5-2_1_2_3","본차시3","page038_03.html",8,"전개","신라의 문화 알아보기","39쪽"],
	["사회 5-2_1_2_3","본차시3","page040_01.html",9,"전개","가야의 성장과 생활 모습 알아보기","40쪽"],
	["사회 5-2_1_2_3","본차시3","page040_02.html",10,"전개","궁금해요","40쪽"],
	["사회 5-2_1_2_3","본차시3","page040_03.html",11,"정리","정리해요","40쪽"],
	["사회 5-2_1_2_3","본차시3","page040_04.html",12,"정리","확인해요","40쪽"],
	["사회 5-2_1_2_3","본차시3","page040_05.html",13,"정리","다음 시간에는","40쪽"],
	["사회 5-2_1_2_4","본차시4","page041_01.html",1,"도입","이번 시간에는","41쪽"],
	["사회 5-2_1_2_4","본차시4","page041_02.html",2,"도입","학습 목표","41쪽"],
	["사회 5-2_1_2_4","본차시4","page041_03.html",3,"도입","생각 열기","41쪽"],
	["사회 5-2_1_2_4","본차시4","page041_04.html",4,"전개","신라의 삼국 통일 알아보기","41쪽"],
	["사회 5-2_1_2_4","본차시4","page041_05.html",5,"전개","활동해요","41쪽"],
	["사회 5-2_1_2_4","본차시4","page042_01.html",6,"전개","통일 후 신라 사람들의 생활 모습 알아보기","42~43쪽"],
	["사회 5-2_1_2_4","본차시4","page043_01.html",7,"정리","정리해요","43쪽"],
	["사회 5-2_1_2_4","본차시4","page043_02.html",8,"정리","확인해요","43쪽"],
	["사회 5-2_1_2_4","본차시4","page043_03.html",9,"정리","다음 시간에는","43쪽"],
	["사회 5-2_1_2_5","본차시5","page044_01.html",1,"도입","이번 시간에는","44쪽"],
	["사회 5-2_1_2_5","본차시5","page044_02.html",2,"도입","학습 목표","44쪽"],
	["사회 5-2_1_2_5","본차시5","page044_03.html",3,"도입","생각 열기","44쪽"],
	["사회 5-2_1_2_5","본차시5","page044_04.html",4,"전개","발해의 성립과 발전 알아보기","44쪽"],
	["사회 5-2_1_2_5","본차시5","page045_01.html",5,"전개","발해 사람들의 생활 모습 알아보기","45쪽"],
	["사회 5-2_1_2_5","본차시5","page045_02.html",6,"전개","활동해요","45쪽"],
	["사회 5-2_1_2_5","본차시5","page046_01.html",7,"전개","창의 융합 활동","46쪽"],
	["사회 5-2_1_2_5","본차시5","page046_02.html",8,"정리","정리해요","46쪽"],
	["사회 5-2_1_2_5","본차시5","page046_03.html",9,"정리","확인해요","46쪽"],
	["사회 5-2_1_2_5","본차시5","page047_01.html",10,"정리","재미 콕콕 주제 마무리","47쪽"],
	["사회 5-2_1_2_5","본차시5","page047_02.html",11,"정리","스스로 평가해요","47쪽"],
	["사회 5-2_1_2_5","본차시5","page047_03.html",12,"정리","다음 시간에는","47쪽"],

	["사회 5-2_1_3","주제 도입","page048_01.html",1,"도입","이번 시간에는","48쪽"],
	["사회 5-2_1_3","주제 도입","page048_02.html",2,"도입","이 주제를 배우면?","48쪽"],
	["사회 5-2_1_3","주제 도입","page048_03.html",3,"전개","생각이 활짝","48~49쪽"],
	["사회 5-2_1_3","주제 도입","page048_04.html",4,"정리","다음 시간에는","48~49쪽"],
	["사회 5-2_1_3_1","본차시1","page050_01.html",1,"도입","이번 시간에는","50쪽"],
	["사회 5-2_1_3_1","본차시1","page050_02.html",2,"도입","학습 목표","50쪽"],
	["사회 5-2_1_3_1","본차시1","page050_03.html",3,"도입","생각 열기","50쪽"],
	["사회 5-2_1_3_1","본차시1","page050_04.html",4,"전개","고려의 건국과 후삼국 통일 과정 알아보기","50쪽"],
	["사회 5-2_1_3_1","본차시1","page051_01.html",5,"전개","고려의 발전 알아보기","51쪽"],
	["사회 5-2_1_3_1","본차시1","page051_02.html",6,"전개","활동해요","51쪽"],
	["사회 5-2_1_3_1","본차시1","page051_03.html",7,"정리","정리해요","51쪽"],
	["사회 5-2_1_3_1","본차시1","page051_04.html",8,"정리","확인해요","51쪽"],
	["사회 5-2_1_3_1","본차시1","page051_05.html",9,"정리","다음 시간에는","51쪽"],
	["사회 5-2_1_3_2","본차시2","page052_01.html",1,"도입","이번 시간에는","52쪽"],
	["사회 5-2_1_3_2","본차시2","page052_02.html",2,"도입","학습 목표","52쪽"],
	["사회 5-2_1_3_2","본차시2","page052_03.html",3,"도입","생각 열기","52쪽"],
	["사회 5-2_1_3_2","본차시2","page052_04.html",4,"전개","고려 시대 신분에 따른 생활 모습 알아보기","52쪽"],
	["사회 5-2_1_3_2","본차시2","page052_05.html",5,"전개","활동해요","52쪽"],
	["사회 5-2_1_3_2","본차시2","page053_01.html",6,"전개","고려의 혼인과 재산 상속 알아보기","53쪽"],
	["사회 5-2_1_3_2","본차시2","page053_02.html",7,"전개","활동해요","53쪽"],
	["사회 5-2_1_3_2","본차시2","page054_01.html",8,"전개","세계에 ‘코리아’를 알린 고려의 대외 교류 알아보기","54쪽"],
	["사회 5-2_1_3_2","본차시2","page054_02.html",9,"정리","정리해요","54쪽"],
	["사회 5-2_1_3_2","본차시2","page054_03.html",10,"정리","확인해요","54쪽"],
	["사회 5-2_1_3_2","본차시2","page054_04.html",11,"정리","다음 시간에는","54쪽"],
	["사회 5-2_1_3_3","본차시3","page055_01.html",1,"도입","이번 시간에는","55쪽"],
	["사회 5-2_1_3_3","본차시3","page055_02.html",2,"도입","학습 목표","55쪽"],
	["사회 5-2_1_3_3","본차시3","page055_03.html",3,"도입","생각 열기","55쪽"],
	["사회 5-2_1_3_3","본차시3","page055_04.html",4,"전개","거란의 침입 극복 알아보기","55쪽"],
	["사회 5-2_1_3_3","본차시3","page055_05.html",5,"전개","활동해요","55쪽"],
	["사회 5-2_1_3_3","본차시3","page056_01.html",6,"전개","몽골의 침입과 항전 알아보기","56쪽"],
	["사회 5-2_1_3_3","본차시3","page057_01.html",7,"전개","원 간섭기 고려 사회의 변화 알아보기","57쪽"],
	["사회 5-2_1_3_3","본차시3","page057_02.html",8,"정리","정리해요","57쪽"],
	["사회 5-2_1_3_3","본차시3","page057_03.html",9,"정리","확인해요","57쪽"],
	["사회 5-2_1_3_3","본차시3","page057_04.html",10,"정리","다음 시간에는","57쪽"],
	["사회 5-2_1_3_4","본차시4","page058_01.html",1,"도입","이번 시간에는","58쪽"],
	["사회 5-2_1_3_4","본차시4","page058_02.html",2,"도입","학습 목표","58쪽"],
	["사회 5-2_1_3_4","본차시4","page058_03.html",3,"도입","생각 열기","58쪽"],
	["사회 5-2_1_3_4","본차시4","page058_04.html",4,"전개","고려의 불교문화 발달 알아보기","58~59쪽"],
	["사회 5-2_1_3_4","본차시4","page059_01.html",5,"전개","궁금해요","59쪽"],
	["사회 5-2_1_3_4","본차시4","page060_01.html",6,"전개","고려청자의 발달 파악하기","60쪽"],
	["사회 5-2_1_3_4","본차시4","page060_02.html",7,"전개","활동해요","60쪽"],
	["사회 5-2_1_3_4","본차시4","page061_01.html",8,"전개","고려 인쇄술의 발달 알아보기","61쪽"],
	["사회 5-2_1_3_4","본차시4","page061_02.html",9,"전개","활동해요","61쪽"],
	["사회 5-2_1_3_4","본차시4","page062_01.html",10,"전개","창의 융합 활동","62쪽"],
	["사회 5-2_1_3_4","본차시4","page062_02.html",11,"정리","정리해요","62쪽"],
	["사회 5-2_1_3_4","본차시4","page062_03.html",12,"정리","확인해요","62쪽"],
	["사회 5-2_1_3_4","본차시4","page063_01.html",13,"정리","재미 콕콕 주제 마무리","63쪽"],
	["사회 5-2_1_3_4","본차시4","page063_02.html",14,"정리","스스로 평가해요","63쪽"],
	["사회 5-2_1_3_4","본차시4","page063_03.html",15,"정리","다음 시간에는","63쪽"],
	["사회 5-2_1_3","단원마무리","page064_01.html",1,"도입","이번 시간에는","64쪽"],
	["사회 5-2_1_3","단원마무리","page064_02.html",2,"도입","학습 목표","64쪽"],
	["사회 5-2_1_3","단원마무리","page064_03.html",3,"전개","생각 그물로 정리해요","64~65쪽"],
	["사회 5-2_1_3","단원마무리","page066_01.html",4,"전개","문제로 정리해요","66~67쪽"],
	["사회 5-2_1_3","단원마무리","page066_02.html",5,"정리","다음 시간에는","66~67쪽"],

	["사회 5-2_2_1","단원 도입 / 주제 도입","page068_01.html",1,"도입","이번 시간에는","68~71쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page068_02.html",2,"도입","학습 목표","68~71쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page068_03.html",3,"도입","무엇을 배울까요?","68~71쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page068_04.html",4,"도입","숨은 장면 열어 보기","68~71쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page068_05.html",5,"도입","단원 열기 1","68~71쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page068_06.html",6,"도입","단원 열기 2","68~71쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page072_01.html",7,"도입","이번 시간에는","72쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page072_02.html",8,"도입","이 주제를 배우면?","72쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page072_03.html",9,"전개","생각이 활짝","72~73쪽"],
	["사회 5-2_2_1","단원 도입 / 주제 도입","page072_04.html",10,"정리","다음 시간에는","72~73쪽"],
	["사회 5-2_2_1_1","본차시1","page074_01.html",1,"도입","이번 시간에는","74쪽"],
	["사회 5-2_2_1_1","본차시1","page074_02.html",2,"도입","학습 목표","74쪽"],
	["사회 5-2_2_1_1","본차시1","page074_03.html",3,"도입","생각 열기","74쪽"],
	["사회 5-2_2_1_1","본차시1","page074_04.html",4,"전개","고려 말의 상황과 조선의 건국 과정 알아보기","74쪽"],
	["사회 5-2_2_1_1","본차시1","page075_01.html",5,"전개","유교의 가르침에 따라 나라를 다스리기 위한 노력 알아보기","75쪽"],
	["사회 5-2_2_1_1","본차시1","page075_02.html",6,"전개","활동해요","75쪽"],
	["사회 5-2_2_1_1","본차시1","page076_01.html",7,"전개","궁금해요","76~77쪽"],
	["사회 5-2_2_1_1","본차시1","page077_01.html",8,"정리","정리해요","77쪽"],
	["사회 5-2_2_1_1","본차시1","page077_02.html",9,"정리","확인해요","77쪽"],
	["사회 5-2_2_1_1","본차시1","page077_03.html",10,"정리","다음 시간에는","77쪽"],
	["사회 5-2_2_1_2","본차시2","page078_01.html",1,"도입","이번 시간에는","78쪽"],
	["사회 5-2_2_1_2","본차시2","page078_02.html",2,"도입","학습 목표","78쪽"],
	["사회 5-2_2_1_2","본차시2","page078_03.html",3,"도입","생각 열기","78쪽"],
	["사회 5-2_2_1_2","본차시2","page078_04.html",4,"전개","조선 전기 과학 기술의 발전 알아보기","78~79쪽"],
	["사회 5-2_2_1_2","본차시2","page080_01.html",5,"전개","훈민정음의 창제 알아보기","80쪽"],
	["사회 5-2_2_1_2","본차시2","page080_02.html",6,"전개","활동해요","80~81쪽"],
	["사회 5-2_2_1_2","본차시2","page081_01.html",7,"전개","다양한 책의 편찬 알아보기","81쪽"],
	["사회 5-2_2_1_2","본차시2","page081_02.html",8,"정리","정리해요","81쪽"],
	["사회 5-2_2_1_2","본차시2","page081_03.html",9,"정리","확인해요","81쪽"],
	["사회 5-2_2_1_2","본차시2","page081_04.html",10,"정리","다음 시간에는","81쪽"],
	["사회 5-2_2_1_3","본차시3","page082_01.html",1,"도입","이번 시간에는","82쪽"],
	["사회 5-2_2_1_3","본차시3","page082_02.html",2,"도입","학습 목표","82쪽"],
	["사회 5-2_2_1_3","본차시3","page082_03.html",3,"도입","생각 열기","82쪽"],
	["사회 5-2_2_1_3","본차시3","page082_04.html",4,"전개","신분에 따른 생활 모습 알아보기","82쪽"],
	["사회 5-2_2_1_3","본차시3","page082_05.html",5,"전개","활동해요","82쪽"],
	["사회 5-2_2_1_3","본차시3","page083_01.html",6,"전개","유교를 보급하기 위한 노력 알아보기","83쪽"],
	["사회 5-2_2_1_3","본차시3","page083_02.html",7,"전개","활동해요","83쪽"],
	["사회 5-2_2_1_3","본차시3","page084_01.html",8,"전개","일상생활 속에 스며든 유교 알아보기","84쪽"],
	["사회 5-2_2_1_3","본차시3","page085_01.html",9,"전개","궁금해요","85쪽"],
	["사회 5-2_2_1_3","본차시3","page085_02.html",10,"정리","정리해요","85쪽"],
	["사회 5-2_2_1_3","본차시3","page085_03.html",11,"정리","확인해요","85쪽"],
	["사회 5-2_2_1_3","본차시3","page085_04.html",12,"정리","다음 시간에는","85쪽"],
	["사회 5-2_2_1_4","본차시4","page086_01.html",1,"도입","이번 시간에는","86쪽"],
	["사회 5-2_2_1_4","본차시4","page086_02.html",2,"도입","학습 목표","86쪽"],
	["사회 5-2_2_1_4","본차시4","page086_03.html",3,"도입","생각 열기","86쪽"],
	["사회 5-2_2_1_4","본차시4","page086_04.html",4,"전개","임진왜란의 전개 과정 알아보기","86~87쪽"],
	["사회 5-2_2_1_4","본차시4","page088_01.html",5,"전개","병자호란의 전개 과정 알아보기","88쪽"],
	["사회 5-2_2_1_4","본차시4","page089_01.html",6,"전개","창의 융합 활동","89쪽"],
	["사회 5-2_2_1_4","본차시4","page090_01.html",7,"전개","궁금해요","90쪽"],
	["사회 5-2_2_1_4","본차시4","page090_02.html",8,"정리","정리해요","90쪽"],
	["사회 5-2_2_1_4","본차시4","page090_03.html",9,"정리","확인해요","90쪽"],
	["사회 5-2_2_1_4","본차시4","page091_01.html",10,"정리","재미 콕콕 주제 마무리","91쪽"],
	["사회 5-2_2_1_4","본차시4","page091_02.html",11,"정리","스스로 평가해요","91쪽"],
	["사회 5-2_2_1_4","본차시4","page091_03.html",12,"정리","다음 시간에는","91쪽"],

	["사회 5-2_2_2","주제 도입","page092_01.html",1,"도입","이번 시간에는","92~93쪽"],
	["사회 5-2_2_2","주제 도입","page092_02.html",2,"도입","이 주제를 배우면?","92~93쪽"],
	["사회 5-2_2_2","주제 도입","page092_03.html",3,"전개","생각이 활짝","92~93쪽"],
	["사회 5-2_2_2","주제 도입","page092_04.html",4,"정리","다음 시간에는","92~93쪽"],
	["사회 5-2_2_2_1","본차시1","page094_01.html",1,"도입","이번 시간에는","94쪽"],
	["사회 5-2_2_2_1","본차시1","page094_02.html",2,"도입","학습 목표","94쪽"],
	["사회 5-2_2_2_1","본차시1","page094_03.html",3,"도입","생각 열기","94쪽"],
	["사회 5-2_2_2_1","본차시1","page094_04.html",4,"전개","영조의 개혁 정치 알아보기","94쪽"],
	["사회 5-2_2_2_1","본차시1","page094_05.html",5,"전개","활동해요","94쪽"],
	["사회 5-2_2_2_1","본차시1","page095_01.html",6,"전개","정조의 개혁 정치 알아보기","95쪽"],
	["사회 5-2_2_2_1","본차시1","page096_01.html",7,"전개","궁금해요","96쪽"],
	["사회 5-2_2_2_1","본차시1","page097_01.html",8,"전개","실학의 발달 알아보기","97쪽"],
	["사회 5-2_2_2_1","본차시1","page097_02.html",9,"정리","정리해요","97쪽"],
	["사회 5-2_2_2_1","본차시1","page097_03.html",10,"정리","확인해요","97쪽"],
	["사회 5-2_2_2_1","본차시1","page097_04.html",11,"정리","다음 시간에는","97쪽"],
	["사회 5-2_2_2_2","본차시2","page098_01.html",1,"도입","이번 시간에는","98쪽"],
	["사회 5-2_2_2_2","본차시2","page098_02.html",2,"도입","학습 목표","98쪽"],
	["사회 5-2_2_2_2","본차시2","page098_03.html",3,"도입","생각 열기","98쪽"],
	["사회 5-2_2_2_2","본차시2","page098_04.html",4,"전개","서민 문화의 발달 알아보기","98~99쪽"],
	["사회 5-2_2_2_2","본차시2","page100_01.html",5,"전개","풍속화 알아보기","100쪽"],
	["사회 5-2_2_2_2","본차시2","page100_02.html",6,"전개","활동해요","100쪽"],
	["사회 5-2_2_2_2","본차시2","page100_03.html",7,"정리","정리해요","100쪽"],
	["사회 5-2_2_2_2","본차시2","page100_04.html",8,"정리","확인해요","100쪽"],
	["사회 5-2_2_2_2","본차시2","page100_05.html",9,"정리","다음 시간에는","100쪽"],
	["사회 5-2_2_2_3","본차시3","page101_01.html",1,"도입","이번 시간에는","101쪽"],
	["사회 5-2_2_2_3","본차시3","page101_02.html",2,"도입","학습 목표","101쪽"],
	["사회 5-2_2_2_3","본차시3","page101_03.html",3,"도입","생각 열기","101쪽"],
	["사회 5-2_2_2_3","본차시3","page101_04.html",4,"전개","흥선 대원군의 개혁 정치 알아보기","101쪽"],
	["사회 5-2_2_2_3","본차시3","page101_05.html",5,"전개","활동해요","101쪽"],
	["사회 5-2_2_2_3","본차시3","page102_01.html",6,"전개","병인양요와 신미양요 알아보기","102쪽"],
	["사회 5-2_2_2_3","본차시3","page102_02.html",7,"전개","궁금해요","102쪽"],
	["사회 5-2_2_2_3","본차시3","page103_01.html",8,"전개","강화도 조약 알아보기","103쪽"],
	["사회 5-2_2_2_3","본차시3","page103_02.html",9,"전개","활동해요","103쪽"],
	["사회 5-2_2_2_3","본차시3","page103_03.html",10,"정리","정리해요","103쪽"],
	["사회 5-2_2_2_3","본차시3","page103_04.html",11,"정리","확인해요","103쪽"],
	["사회 5-2_2_2_3","본차시3","page103_05.html",12,"정리","다음 시간에는","103쪽"],
	["사회 5-2_2_2_4","본차시4","page104_01.html",1,"도입","이번 시간에는","104쪽"],
	["사회 5-2_2_2_4","본차시4","page104_02.html",2,"도입","학습 목표","104쪽"],
	["사회 5-2_2_2_4","본차시4","page104_03.html",3,"도입","생각 열기","104쪽"],
	["사회 5-2_2_2_4","본차시4","page104_04.html",4,"전개","갑신정변 알아보기","104쪽"],
	["사회 5-2_2_2_4","본차시4","page104_05.html",5,"전개","활동해요","104쪽"],
	["사회 5-2_2_2_4","본차시4","page105_01.html",6,"전개","동학 농민 운동 알아보기","105~106쪽"],
	["사회 5-2_2_2_4","본차시4","page106_01.html",7,"전개","활동해요","106쪽"],
	["사회 5-2_2_2_4","본차시4","page107_01.html",8,"전개","갑오개혁 알아보기","107쪽"],
	["사회 5-2_2_2_4","본차시4","page107_02.html",9,"전개","궁금해요","107쪽"],
	["사회 5-2_2_2_4","본차시4","page107_03.html",10,"정리","정리해요","107쪽"],
	["사회 5-2_2_2_4","본차시4","page107_04.html",11,"정리","확인해요","107쪽"],
	["사회 5-2_2_2_4","본차시4","page107_05.html",12,"정리","다음 시간에는","107쪽"],
	["사회 5-2_2_2_5","본차시5","page108_01.html",1,"도입","이번 시간에는","108쪽"],
	["사회 5-2_2_2_5","본차시5","page108_02.html",2,"도입","학습 목표","108쪽"],
	["사회 5-2_2_2_5","본차시5","page108_03.html",3,"도입","생각 열기","108쪽"],
	["사회 5-2_2_2_5","본차시5","page108_04.html",4,"전개","독립 협회의 활동 알아보기","108쪽"],
	["사회 5-2_2_2_5","본차시5","page109_01.html",5,"전개","대한 제국의 수립 알아보기","109쪽"],
	["사회 5-2_2_2_5","본차시5","page110_01.html",6,"전개","근대 문물의 수용으로 달라진 생활 모습 알아보기","110~111쪽"],
	["사회 5-2_2_2_5","본차시5","page111_01.html",7,"전개","활동해요","111쪽"],
	["사회 5-2_2_2_5","본차시5","page112_01.html",8,"전개","창의 융합 활동","112쪽"],
	["사회 5-2_2_2_5","본차시5","page112_02.html",9,"정리","정리해요","112쪽"],
	["사회 5-2_2_2_5","본차시5","page112_03.html",10,"정리","확인해요","112쪽"],
	["사회 5-2_2_2_5","본차시5","page113_01.html",11,"정리","재미 콕콕 주제 마무리","113쪽"],
	["사회 5-2_2_2_5","본차시5","page113_02.html",12,"정리","스스로 평가해요","113쪽"],
	["사회 5-2_2_2_5","본차시5","page113_03.html",13,"정리","다음 시간에는","113쪽"],
	["사회 5-2_2_2","단원마무리","page114_01.html",1,"도입","이번 시간에는","114쪽"],
	["사회 5-2_2_2","단원마무리","page114_02.html",2,"도입","학습 목표","114쪽"],
	["사회 5-2_2_2","단원마무리","page114_03.html",3,"전개","생각 그물로 정리해요","114~115쪽"],
	["사회 5-2_2_2","단원마무리","page116_01.html",4,"전개","문제로 정리해요","116~117쪽"],
	["사회 5-2_2_2","단원마무리","page116_02.html",5,"정리","다음 시간에는","116~117쪽"],

	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_01.html",1,"도입","이번 시간에는","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_02.html",2,"도입","학습 목표","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_03.html",3,"도입","무엇을 배울까요?","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_04.html",4,"도입","숨은 장면 열어 보기","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_05.html",5,"도입","단원 열기 1","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_06.html",6,"도입","단원 열기 2","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page118_07.html",7,"도입","단원 열기 3","118~121쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page122_01.html",8,"도입","이번 시간에는","122쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page122_02.html",9,"도입","이 주제를 배우면?","122쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page122_03.html",10,"전개","생각이 활짝","122~123쪽"],
	["사회 5-2_3_1","단원 도입 / 주제 도입","page122_04.html",11,"정리","다음 시간에는","122~123쪽"],
	["사회 5-2_3_1_1","본차시1","page124_01.html",1,"도입","이번 시간에는","124쪽"],
	["사회 5-2_3_1_1","본차시1","page124_02.html",2,"도입","학습 목표","124쪽"],
	["사회 5-2_3_1_1","본차시1","page124_03.html",3,"도입","생각 열기","124쪽"],
	["사회 5-2_3_1_1","본차시1","page124_04.html",4,"전개","을사늑약에 대한 사람들의 저항 알기","124쪽"],
	["사회 5-2_3_1_1","본차시1","page125_01.html",5,"전개","항일 의병 운동 살펴보기","125쪽"],
	["사회 5-2_3_1_1","본차시1","page125_02.html",6,"전개","활동해요","125쪽"],
	["사회 5-2_3_1_1","본차시1","page126_01.html",7,"전개","나라를 지키려는 다양한 노력 알기","126쪽"],
	["사회 5-2_3_1_1","본차시1","page126_02.html",8,"정리","정리해요","126쪽"],
	["사회 5-2_3_1_1","본차시1","page126_03.html",9,"정리","확인해요","126쪽"],
	["사회 5-2_3_1_1","본차시1","page126_04.html",10,"정리","다음시간에는","126쪽"],
	["사회 5-2_3_1_2","본차시2","page127_01.html",1,"도입","이번 시간에는","127쪽"],
	["사회 5-2_3_1_2","본차시2","page127_02.html",2,"도입","학습 목표","127쪽"],
	["사회 5-2_3_1_2","본차시2","page127_03.html",3,"도입","생각 열기","127쪽"],
	["사회 5-2_3_1_2","본차시2","page127_04.html",4,"전개","일제의 식민 통치 정책과 사람들의 생활 알아보기","127쪽"],
	["사회 5-2_3_1_2","본차시2","page128_01.html",5,"전개","3∙1 운동 이후 식민 통치 방식의 변화 알아보기","128쪽"],
	["사회 5-2_3_1_2","본차시2","page128_02.html",6,"전개","민족 말살 정책과 사람들의 생활 알아보기","128쪽"],
	["사회 5-2_3_1_2","본차시2","page129_01.html",7,"전개","궁금해요","129쪽"],
	["사회 5-2_3_1_2","본차시2","page130_01.html",8,"전개","궁금해요","130쪽"],
	["사회 5-2_3_1_2","본차시2","page131_01.html",9,"정리","정리해요","131쪽"],
	["사회 5-2_3_1_2","본차시2","page131_02.html",10,"정리","확인해요","131쪽"],
	["사회 5-2_3_1_2","본차시2","page131_03.html",11,"정리","다음 시간에는","131쪽"],
	["사회 5-2_3_1_3","본차시3","page132_01.html",1,"도입","이번 시간에는","132쪽"],
	["사회 5-2_3_1_3","본차시3","page132_02.html",2,"도입","학습 목표","132쪽"],
	["사회 5-2_3_1_3","본차시3","page132_03.html",3,"도입","생각 열기","132쪽"],
	["사회 5-2_3_1_3","본차시3","page132_04.html",4,"전개","3·1 운동 알아보기","132쪽"],
	["사회 5-2_3_1_3","본차시3","page133_01.html",5,"전개","활동해요","133쪽"],
	["사회 5-2_3_1_3","본차시3","page134_01.html",6,"전개","활동해요","134쪽"],
	["사회 5-2_3_1_3","본차시3","page135_01.html",7,"전개","대한민국 임시 정부 알아보기","135쪽"],
	["사회 5-2_3_1_3","본차시3","page135_02.html",8,"전개","궁금해요","135쪽"],
	["사회 5-2_3_1_3","본차시3","page135_03.html",9,"전개","한인 애국단과 한국 광복군","136쪽"],
	["사회 5-2_3_1_3","본차시3","page136_01.html",10,"전개","활동해요","136쪽"],
	["사회 5-2_3_1_3","본차시3","page136_02.html",11,"정리","정리해요","136쪽"],
	["사회 5-2_3_1_3","본차시3","page136_03.html",12,"정리","확인해요","136쪽"],
	["사회 5-2_3_1_3","본차시3","page136_04.html",13,"정리","다음 시간에는","136쪽"],
	["사회 5-2_3_1_4","본차시4","page137_01.html",1,"도입","이번 시간에는","137쪽"],
	["사회 5-2_3_1_4","본차시4","page137_02.html",2,"도입","학습 목표","137쪽"],
	["사회 5-2_3_1_4","본차시4","page137_03.html",3,"도입","생각 열기","137쪽"],
	["사회 5-2_3_1_4","본차시4","page137_04.html",4,"전개","국외로 건너간 독립운동가들 알아보기","137쪽"],
	["사회 5-2_3_1_4","본차시4","page138_01.html",5,"전개","국외의 무장 독립 전쟁 알아보기","138쪽"],
	["사회 5-2_3_1_4","본차시4","page139_01.html",6,"전개","국내의 다양한 독립운동 알아보기","139쪽"],
	["사회 5-2_3_1_4","본차시4","page139_02.html",7,"전개","활동해요","139쪽"],
	["사회 5-2_3_1_4","본차시4","page140_01.html",8,"전개","민족정신을 지키려는 노력 알아보기","140쪽"],
	["사회 5-2_3_1_4","본차시4","page140_02.html",9,"전개","궁금해요","140쪽"],
	["사회 5-2_3_1_4","본차시4","page140_03.html",10,"정리","정리해요","140쪽"],
	["사회 5-2_3_1_4","본차시4","page140_04.html",11,"정리","확인해요","140쪽"],
	["사회 5-2_3_1_4","본차시4","page141_01.html",12,"정리","재미 콕콕 주제 마무리","141쪽"],
	["사회 5-2_3_1_4","본차시4","page141_02.html",13,"정리","스스로 평가해요","141쪽"],
	["사회 5-2_3_1_4","본차시4","page141_03.html",14,"정리","다음 시간에는","141쪽"],

	["사회 5-2_3_2","주제 도입","page142_01.html",1,"도입","이번 시간에는","142~143쪽"],
	["사회 5-2_3_2","주제 도입","page142_02.html",2,"도입","이 주제를 배우면?","142~143쪽"],
	["사회 5-2_3_2","주제 도입","page142_03.html",3,"전개","생각이 활짝","142~143쪽"],
	["사회 5-2_3_2","주제 도입","page142_04.html",4,"정리","다음 시간에는","142~143쪽"],
	["사회 5-2_3_2_1","본차시1","page144_01.html",1,"도입","이번 시간에는","144쪽"],
	["사회 5-2_3_2_1","본차시1","page144_02.html",2,"도입","학습 목표","144쪽"],
	["사회 5-2_3_2_1","본차시1","page144_03.html",3,"도입","생각 열기","144쪽"],
	["사회 5-2_3_2_1","본차시1","page144_04.html",4,"전개","8·15 광복 알아보기","144쪽"],
	["사회 5-2_3_2_1","본차시1","page144_05.html",5,"전개","활동해요","144쪽"],
	["사회 5-2_3_2_1","본차시1","page145_01.html",6,"전개","광복으로 달라진 사람들의 생활 모습 알아보기","145쪽"],
	["사회 5-2_3_2_1","본차시1","page146_01.html",7,"전개","궁금해요","146쪽"],
	["사회 5-2_3_2_1","본차시1","page146_02.html",8,"정리","정리해요","146쪽"],
	["사회 5-2_3_2_1","본차시1","page146_03.html",9,"정리","확인해요","146쪽"],
	["사회 5-2_3_2_1","본차시1","page146_04.html",10,"정리","다음시간에는","146쪽"],
	["사회 5-2_3_2_2","본차시2","page147_01.html",1,"도입","이번 시간에는","147쪽"],
	["사회 5-2_3_2_2","본차시2","page147_02.html",2,"도입","학습 목표","147쪽"],
	["사회 5-2_3_2_2","본차시2","page147_03.html",3,"도입","생각 열기","147쪽"],
	["사회 5-2_3_2_2","본차시2","page147_04.html",4,"전개","한반도의 분단과 통일 정부 수립을 위한 노력 알아보기","147~148쪽"],
	["사회 5-2_3_2_2","본차시2","page148_01.html",5,"전개","활동해요","148쪽"],
	["사회 5-2_3_2_2","본차시2","page148_02.html",6,"전개","궁금해요","148쪽"],
	["사회 5-2_3_2_2","본차시2","page149_01.html",7,"전개","대한민국 정부의 수립 알아보기","149쪽"],
	["사회 5-2_3_2_2","본차시2","page149_02.html",8,"정리","정리해요","149쪽"],
	["사회 5-2_3_2_2","본차시2","page149_03.html",9,"정리","확인해요","149쪽"],
	["사회 5-2_3_2_2","본차시2","page149_04.html",10,"정리","다음 시간에는","149쪽"],
	["사회 5-2_3_2_3","본차시3","page150_01.html",1,"도입","이번 시간에는","150쪽"],
	["사회 5-2_3_2_3","본차시3","page150_02.html",2,"도입","학습 목표","150쪽"],
	["사회 5-2_3_2_3","본차시3","page150_03.html",3,"도입","생각 열기","150쪽"],
	["사회 5-2_3_2_3","본차시3","page150_04.html",4,"전개","영상","150쪽"],
	["사회 5-2_3_2_3","본차시3","page150_05.html",5,"전개","활동해요","150쪽"],
	["사회 5-2_3_2_3","본차시3","page150_06.html",6,"전개","북한군의 남침 알아보기","150쪽"],
	["사회 5-2_3_2_3","본차시3","page151_01.html",7,"전개","국군·국제연합군의 반격 알아보기","151쪽"],
	["사회 5-2_3_2_3","본차시3","page151_02.html",8,"전개","궁금해요","151쪽"],
	["사회 5-2_3_2_3","본차시3","page152_01.html",9,"전개","중국군의 개입 과정 알아보기","152쪽"],
	["사회 5-2_3_2_3","본차시3","page152_02.html",10,"전개","정전 협정 체결 알아보기","152쪽"],
	["사회 5-2_3_2_3","본차시3","page153_01.html",11,"전개","궁금해요","153쪽"],
	["사회 5-2_3_2_3","본차시3","page153_02.html",12,"정리","정리해요","153쪽"],
	["사회 5-2_3_2_3","본차시3","page153_03.html",13,"정리","확인해요","153쪽"],
	["사회 5-2_3_2_3","본차시3","page153_04.html",14,"정리","다음 시간에는","153쪽"],
	["사회 5-2_3_2_4","본차시4","page154_01.html",1,"도입","이번 시간에는","154쪽"],
	["사회 5-2_3_2_4","본차시4","page154_02.html",2,"도입","학습 목표","154쪽"],
	["사회 5-2_3_2_4","본차시4","page154_03.html",3,"도입","생각 열기","154쪽"],
	["사회 5-2_3_2_4","본차시4","page154_04.html",4,"전개","6·25 전쟁의 피해와 영향 알아보기","154~155쪽"],
	["사회 5-2_3_2_4","본차시4","page155_01.html",5,"전개","궁금해요","155쪽"],
	["사회 5-2_3_2_4","본차시4","page156_01.html",6,"전개","창의 융합 활동","156쪽"],
	["사회 5-2_3_2_4","본차시4","page156_02.html",7,"정리","정리해요","156쪽"],
	["사회 5-2_3_2_4","본차시4","page156_03.html",8,"정리","확인해요","156쪽"],
	["사회 5-2_3_2_4","본차시4","page157_01.html",9,"정리","재미 콕콕 주제 마무리","157쪽"],
	["사회 5-2_3_2_4","본차시4","page157_02.html",10,"정리","스스로 평가해요","157쪽"],
	["사회 5-2_3_2_4","본차시4","page157_03.html",11,"정리","다음 시간에는","157쪽"],
	["사회 5-2_3_2","단원마무리","page158_01.html",1,"도입","이번 시간에는","158쪽"],
	["사회 5-2_3_2","단원마무리","page158_02.html",2,"도입","학습 목표","158쪽"],
	["사회 5-2_3_2","단원마무리","page158_03.html",3,"전개","생각 그물로 정리해요","158~159쪽"],
	["사회 5-2_3_2","단원마무리","page160_01.html",4,"전개","문제로 정리해요","160~161쪽"]
]